qmckl_verificarlo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-12 Fri 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Verificarlo CI</title>
<meta name="author" content="TREX CoE" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Verificarlo CI</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga3c3120">1. Verificarlo probes</a>
<ul>
<li><a href="#org7bbe940">1.1. Automatically initialize the <code>vfc_probe</code> object if <code>VFC_CI</code> is defined</a></li>
<li><a href="#org7e0b014">1.2. Standard probe, without check</a></li>
<li><a href="#org7d45643">1.3. Probe with absolute check</a></li>
<li><a href="#orgbce0497">1.4. Probe with relative check</a></li>
<li><a href="#org16f514d">1.5. Automatically delete and dump the vfc<sub>probe</sub> object if <code>VFC_CI</code> is defined</a></li>
</ul>
</li>
<li><a href="#orgd407f2a">2. Fortran wrappers</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga3c3120" class="outline-2">
<h2 id="orga3c3120"><span class="section-number-2">1.</span> Verificarlo probes</h2>
<div class="outline-text-2" id="text-1">
<p>
This file contains utility functions to enable the Verificarlo
Continuous Integration system (<code>VFC_CI</code>).
</p>

<p>
It is a wrapper to Verificarlo's <code>vfc_probes</code> system. The goal of QMCkl
probes is to simplify the use of <code>vfc_probes</code>, and to provide functions that
can be called either with or without <code>VFC_CI</code> support by using <code>#ifndef</code>
statements :
</p>

<ul class="org-ul">
<li>when <code>VFC_CI</code> is disabled, the functions will either return <code>false</code>
(no error) or perform a check based on a reference value</li>

<li>when <code>VFC_CI</code> is enabled, the functions will simply encapsulate</li>
</ul>
<p>
calls to <code>vfc_probe</code>.
</p>

<p>
Moreover, one does not have to worry about the life cycle of the probes
structure, as it is automatically created, dumped and freed by this wrapper.
</p>

<p>
<code>VFC_CI</code> support can be enabled by using the following configure command :
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #a0522d;">QMCKL_DEVEL</span>=1 ./configure --prefix=$<span style="color: #a0522d;">PWD</span>/_install --enable-silent-rules <span style="color: #8b2252;">\</span>
  --enable-maintainer-mode <span style="color: #a0522d;">CC</span>=verificarlo-f <span style="color: #a0522d;">FC</span>=verificarlo-f --host=x86_64
</pre>
</div>

<p>
Finally, this wrapper also comes with a Fortran interface (in its dedicated
file).
</p>

<p>
To learn more about Verificarlo CI :
<a href="https://github.com/verificarlo/verificarlo/blob/master/doc/06-Postprocessing.md#verificarlo-ci">https://github.com/verificarlo/verificarlo/blob/master/doc/06-Postprocessing.md#verificarlo-ci</a>
</p>
</div>


<div id="outline-container-org7bbe940" class="outline-3">
<h3 id="org7bbe940"><span class="section-number-3">1.1.</span> Automatically initialize the <code>vfc_probe</code> object if <code>VFC_CI</code> is defined</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">qmckl_init_probes</span>();
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">qmckl_init_probes</span>(){
<span style="color: #483d8b;">#ifdef</span> VFC_CI
        probes = vfc_init_probes();
<span style="color: #483d8b;">#endif</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e0b014" class="outline-3">
<h3 id="org7e0b014"><span class="section-number-3">1.2.</span> Standard probe, without check</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>if <code>VFC_CI</code> is defined, place a standard probe</li>
<li><p>
if <code>VFC_CI</code> is undefined, return <code>false</code> (no error)
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>)
{
<span style="color: #483d8b;">#ifdef</span> VFC_CI
    <span style="color: #a020f0;">return</span> vfc_probe(&amp;probes, testName, varName, value);
<span style="color: #483d8b;">#else</span>
        <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">false</span>;
<span style="color: #483d8b;">#endif</span>
}
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org7d45643" class="outline-3">
<h3 id="org7d45643"><span class="section-number-3">1.3.</span> Probe with absolute check</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>if <code>VFC_CI</code> is defined, place a probe with an absolute check</li>
<li><p>
if <code>VFC_CI</code> is undefined, perform an absolute check based on target value
and accuracy
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">accuracyTarget</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">accuracyTarget</span>)
{
<span style="color: #483d8b;">#ifdef</span> VFC_CI
    <span style="color: #a020f0;">return</span> vfc_probe_check(&amp;probes, testName, varName, value, accuracyTarget);
<span style="color: #483d8b;">#else</span>
    <span style="color: #a020f0;">return</span> !(fabs(value - expectedValue) &lt; accuracyTarget);
<span style="color: #483d8b;">#endif</span>
}
</pre>
</div></li>
</ul>
</div>
</div>
