org/qmckl_verificarlo.org
** Probe with relative check

 - if VFC_CI is defined, place a probe with a relative check
 - if VFC_CI is undefined, perform a relative check based on target value
   and accuracy

  #+begin_src c :tangle (eval h_private_func)
bool qmckl_probe_check_relative(
    char * testName,
    char * varName,
    double value,
    double expectedValue,
    double accuracyTarget
);
  #+end_src

  #+begin_src c :tangle (eval c)
bool qmckl_probe_check_relative (
    char * testName,
    char * varName,
    double value,
    double expectedValue,
    double accuracyTarget)
{
#ifdef VFC_CI
    return vfc_probe_check_relative(&probes, testName, varName, value, accuracyTarget);
#else
    return !(fabs(value - expectedValue) / fabs(expectedValue) < accuracyTarget);
#endif
}
  #+end_src

** Automatically delete and dump the vfc_probe object if ~VFC_CI~ is defined

  #+begin_src c :tangle (eval h_private_func)
#ifdef VFC_CI
void qmckl_dump_probes() __attribute__((destructor));
#endif
  #+end_src

  #+begin_src c :tangle (eval c)
#ifdef VFC_CI
void __attribute__((destructor)) qmckl_dump_probes(){
    vfc_dump_probes(&probes);
}
#endif
  #+end_src

