qmckl_verificarlo.html

<div id="outline-container-orgbce0497" class="outline-3">
<h3 id="orgbce0497"><span class="section-number-3">1.4.</span> Probe with relative check</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>if <code>VFC_CI</code> is defined, place a probe with a relative check</li>
<li><p>
if <code>VFC_CI</code> is undefined, perform a relative check based on target value
and accuracy
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check_relative</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">accuracyTarget</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check_relative</span> (
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">accuracyTarget</span>)
{
<span style="color: #483d8b;">#ifdef</span> VFC_CI
    <span style="color: #a020f0;">return</span> vfc_probe_check_relative(&amp;probes, testName, varName, value, accuracyTarget);
<span style="color: #483d8b;">#else</span>
    <span style="color: #a020f0;">return</span> !(fabs(value - expectedValue) / fabs(expectedValue) &lt; accuracyTarget);
<span style="color: #483d8b;">#endif</span>
}
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org16f514d" class="outline-3">
<h3 id="org16f514d"><span class="section-number-3">1.5.</span> Automatically delete and dump the vfc<sub>probe</sub> object if <code>VFC_CI</code> is defined</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">qmckl_dump_probes</span>();
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">qmckl_dump_probes</span>(){
<span style="color: #483d8b;">#ifdef</span> VFC_CI
    vfc_dump_probes(&amp;probes);
<span style="color: #483d8b;">#endif</span>
}
</pre>
</div>
</div>
</div>
</div>
