share/doc/qmckl/text/qmckl_verificarlo.txt


1.4 Probe with relative check
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  - if `VFC_CI' is defined, place a probe with a relative check
  - if `VFC_CI' is undefined, perform a relative check based on target
    value and accuracy

    ,----
    | bool qmckl_probe_check_relative(
    |     char * testName,
    |     char * varName,
    |     double value,
    |     double expectedValue,
    |     double accuracyTarget
    | );
    `----

    ,----
    | bool qmckl_probe_check_relative (
    |     char * testName,
    |     char * varName,
    |     double value,
    |     double expectedValue,
    |     double accuracyTarget)
    | {
    | #ifdef VFC_CI
    |     return vfc_probe_check_relative(&probes, testName, varName, value, accuracyTarget);
    | #else
    |     return !(fabs(value - expectedValue) / fabs(expectedValue) < accuracyTarget);
    | #endif
    | }
    `----


1.5 Automatically delete and dump the vfc_probe object if `VFC_CI' is defined
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  ,----
  | void qmckl_dump_probes();
  `----

  ,----
  | void qmckl_dump_probes(){
  | #ifdef VFC_CI
  |     vfc_dump_probes(&probes);
  | #endif
  | }
  `----
