qmckl_verificarlo.html

<div id="outline-container-orgd407f2a" class="outline-2">
<h2 id="orgd407f2a"><span class="section-number-2">2.</span> Fortran wrappers</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_f</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">value</span>
);

<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check_f</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">accuracyTarget</span>
);


<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check_relative_f</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">accuracyTarget</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_f</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">value</span>)
{
    <span style="color: #a020f0;">return</span> qmckl_probe(testName, varName, *value);
}


<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check_f</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">accuracyTarget</span>)
{
    <span style="color: #a020f0;">return</span> qmckl_probe_check(
        testName, varName,
        *value, *expectedValue, *accuracyTarget
    );
}


<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_probe_check_relative_f</span>(
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">testName</span>,
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">varName</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">value</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">expectedValue</span>,
    <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">accuracyTarget</span>)
{
    <span style="color: #a020f0;">return</span> qmckl_probe_check_relative(
        testName, varName,
        *value, *expectedValue, *accuracyTarget
    );
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">module</span> <span style="color: #0000ff;">qmckl_verificarlo_f</span>
  <span style="color: #a020f0;">interface</span>
     <span style="color: #228b22;">logical</span>(<span style="color: #008b8b;">c_bool</span>)<span style="color: #a0522d;"> </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_probe</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
<span style="color: #a0522d;">          (testName, varName, val) </span><span style="color: #a020f0;">&amp;</span>
<span style="color: #a0522d;">          bind(C, name=</span><span style="color: #8b2252;">"qmckl_probe_f"</span><span style="color: #a0522d;">)</span>

       <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
       <span style="color: #a020f0;">import</span>
       <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

       <span style="color: #228b22;">character</span>(<span style="color: #008b8b;">C_CHAR</span>), <span style="color: #a020f0;">dimension</span>(*) ::<span style="color: #a0522d;"> testName</span>
       <span style="color: #228b22;">character</span>(<span style="color: #008b8b;">C_CHAR</span>), <span style="color: #a020f0;">dimension</span>(*) ::<span style="color: #a0522d;"> varName</span>

       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> val</span>
     <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_probe</span>

     <span style="color: #228b22;">logical</span>(<span style="color: #008b8b;">c_bool</span>)<span style="color: #a0522d;"> </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_probe_check</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
<span style="color: #a0522d;">          (testName, varName, val, expectedValue, accuracyTarget) </span><span style="color: #a020f0;">&amp;</span>
<span style="color: #a0522d;">          bind(C, name=</span><span style="color: #8b2252;">"qmckl_probe_check_f"</span><span style="color: #a0522d;">)</span>

       <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
       <span style="color: #a020f0;">import</span>
       <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

       <span style="color: #228b22;">character</span>(<span style="color: #008b8b;">C_CHAR</span>), <span style="color: #a020f0;">dimension</span>(*) ::<span style="color: #a0522d;"> testName</span>
       <span style="color: #228b22;">character</span>(<span style="color: #008b8b;">C_CHAR</span>), <span style="color: #a020f0;">dimension</span>(*) ::<span style="color: #a0522d;"> varName</span>

       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> val</span>
       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> expectedValue</span>
       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> accuracyTarget</span>
     <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_probe_check</span>

     <span style="color: #228b22;">logical</span>(<span style="color: #008b8b;">c_bool</span>)<span style="color: #a0522d;"> </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_probe_check_relative</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
<span style="color: #a0522d;">          (testName, varName, val, expectedValue, accuracyTarget) </span><span style="color: #a020f0;">&amp;</span>
<span style="color: #a0522d;">          bind(C, name=</span><span style="color: #8b2252;">"qmckl_probe_check_relative_f"</span><span style="color: #a0522d;">)</span>

       <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
       <span style="color: #a020f0;">import</span>
       <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

       <span style="color: #228b22;">character</span>(<span style="color: #008b8b;">C_CHAR</span>), <span style="color: #a020f0;">dimension</span>(*) ::<span style="color: #a0522d;"> testName</span>
       <span style="color: #228b22;">character</span>(<span style="color: #008b8b;">C_CHAR</span>), <span style="color: #a020f0;">dimension</span>(*) ::<span style="color: #a0522d;"> varName</span>

       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> val</span>
       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> expectedValue</span>
       <span style="color: #228b22;">real</span>(<span style="color: #008b8b;">C_DOUBLE</span>) ::<span style="color: #a0522d;"> accuracyTarget</span>
     <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_probe_check_relative</span>
  <span style="color: #a020f0;">end interface</span>
<span style="color: #a020f0;">end module</span> <span style="color: #0000ff;">qmckl_verificarlo_f</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX CoE</p>
<p class="date">Created: 2025-12-12 Fri 14:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
